//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВремяВыполнения = 0;
	Для каждого ТекСтрока Из Проекты Цикл
		ВремяВыполнения = ВремяВыполнения + УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрока.ВремяВыполнения);
	КонецЦикла;
	ВремяВыполненияДокумента = УП_ОбщегоНазначения_Сервер.ПреобразоватьЧислоВВремя_Строка(ВремяВыполнения);
	
КонецПроцедуры

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого ТекСтрока Из Проекты Цикл
		// регистр ВремяВыполненияПроектов
		Движения.ВремяВыполненияПроектов.Записывать = Истина;
		Движение                      = Движения.ВремяВыполненияПроектов.Добавить();
		Движение.РегистраторСсылка    = Ссылка;
		Движение.Контрагент           = Контрагент;
		Движение.Проект               = ТекСтрока.Проект;
		Движение.ВремяВыполнения_План = 0;
		Движение.ВремяВыполнения_Факт = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрока.ВремяВыполнения);
		Движение.Исполнитель          = Исполнитель;
	КонецЦикла;
	
	// регистр УП_ВремяВыполнения_Факт
	Движения.УП_ВремяВыполнениеПроектов_Факт.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
		
		Движение                              = Движения.УП_ВремяВыполнениеПроектов_Факт.Добавить();
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		Движение.Исполнитель                  = Исполнитель;
		Движение.ВремяВыполнения              = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрокаПроекты.ВремяВыполнения);
	КонецЦикла;
	
КонецПроцедуры