&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//// отменяем стандартное поведение при начале выбора
	//СтандартнаяОбработка = ложь;
	//// получим форму для выбора
	//Форма = ПолучитьФорму("Справочник.Проекты.ФормаВыбора");
	//// добавим отбор по владельцу
	//ЭлементОтбора                = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = Объект.Контрагент;
	//// укажем что форма для выбора
	//Форма.Параметры.РежимВыбора = Истина;
	//// укажем куда поместить значение выбора
	//Форма.ВладелецФормы = Элементы.Проект;
	//// откроем форму
	//Форма.Открыть();

КонецПроцедуры