&НаКлиенте
Процедура ОткрытьДокументНаКлиенте(Элемент)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ." + ОтсечьЦифры(Элемент.Имя) + ".ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетНаКлиенте(Элемент)

	Попытка
		ФормаСписка = ПолучитьФорму("Отчет." + ОтсечьЦифры(Элемент.Имя) + ".Форма");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ОтсечьЦифры(ИсходнаяСтрока)

	ФинальнаяСтрока = ИсходнаяСтрока;
	КодСимвола = КодСимвола(Прав(ИсходнаяСтрока, 1));
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - 1);
	КонецЕсли;
	Возврат ФинальнаяСтрока;

КонецФункции // ОтсечьЦифры()

&НаКлиенте
Процедура ОткрытьДокументПоступлениеОплатыОтКонтрагента(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ.ПоступлениеОплатыОтКонтрагента.ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВзаиморасчетыСКонтрагентами(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Отчет.ВзаиморасчетыСКонтрагентами.Форма");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоступлениеДенежныхСредств(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Отчет.ПоступлениеДенежныхСредств.Форма");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументСогласованиеПроектов(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ.СогласованиеПроектов.ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументВыполнениеПроектов(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ.ВыполнениеПроектов.ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументВыполнениеРаботНадПроектом(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ.ВыполнениеРаботНадПроектом.ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОтработкаПоВремени(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Отчет.ОтработкаПоВремени.Форма");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументРасходыНаПроекты(Команда)

	Попытка
		ФормаСписка = ПолучитьФорму("Документ.РасходыНаПроекты.ФормаСписка");
		ФормаСписка.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;

КонецПроцедуры
