#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьМаркерПриИзменении(Элемент)
	
	Элементы.ГруппаМаркер.Видимость = Объект.ИспользоватьМаркер;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	// шаблон: ТекущаяДата + "_" + Клиент + "_" + Название проекта
	Объект.Наименование = Строка(Формат(ТекущаяДата(), "ДЛФ=D")) + "_" + Строка(Объект.Клиент) + "_";
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТехническоеЗадание(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СформироватьМаркерНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.Клиент) Тогда
		Объект.Маркер = Строка(Объект.Контрагент.ПрефиксМаркеровки) + "_" + Строка(Объект.Клиент.ПрефиксМаркеровки) + "_";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМаркер(Команда)
	
	СформироватьМаркерНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаМаркер.Видимость = Объект.ИспользоватьМаркер;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ОтчетДляКлиентаПоПлану = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КомментарийПроекта = ТекущийОбъект.КомментарийХранилищеЗначений.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.КомментарийХранилищеЗначений = Новый ХранилищеЗначения(КомментарийПроекта);
	
КонецПроцедуры

#КонецОбласти