// Устанавливает текст информационной надписи о количестве и сумме
// проектов подобранных в корзину на форме подбора.
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора.
//
Процедура УстановитьТекстИнформационнойНадписи(Форма) Экспорт
	
	Корзина = Форма.Объект.Корзина;
	
	//Сумма = Формат(Корзина.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=");
	Количество = НРег(ЧислоПрописью(Корзина.Количество(), "Л = ru_RU; ДП = Ложь; НП = Истина; НД = Ложь;", НСтр("ru = 'позиция,позиции,позиций,ж,,,,,0'")));
	
	ИнформационнаяНадпись = НСтр("ru = 'Всего подобрано [Количество] проектов [СкрытьПоказать]'");
	
	СкрытьПоказать = "";
	
	//Если Форма.РежимПодбораБезКоличественныхПараметров Или Форма.РежимПодбораБезСуммовыхПараметров Тогда
	//	ИнформационнаяНадпись = НСтр("ru = 'Всего подобрано [Количество] товаров [СкрытьПоказать]'");
	//КонецЕсли;
	
	СкрытьПоказать = ?(Форма.ПоказыватьПодобранныеПроекты, НСтр("ru = '(скрыть)'"), НСтр("ru = '(показать)'"));
	
	ВставляемыеЗначения = Новый Структура("Количество, СкрытьПоказать", Количество, СкрытьПоказать);
	
	ИнформационнаяНадпись = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ИнформационнаяНадпись, ВставляемыеЗначения);
	
	Форма.ИнформационнаяНадпись = ИнформационнаяНадпись;
	
КонецПроцедуры

// Процедура вызывается при нажатии на информационную надпись - строку с информацией 
// о количестве и сумме подобранных товаров на формах подборов.
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора,
//	Объект (ОбработкаОбъект, ДокументОбъект) - объект подбора.
//
Процедура ПриНажатииНаИнформационнуюНадпись(Форма, Объект) Экспорт
	
	Форма.ПоказыватьПодобранныеПроекты = Не Форма.ПоказыватьПодобранныеПроекты;
	Форма.Элементы.ОбластьПодобранныеПроекты.Видимость = Форма.ПоказыватьПодобранныеПроекты;
	
	УП_ПодборПроектовКлиентСервер.УстановитьТекстИнформационнойНадписи(Форма);
	
КонецПроцедуры
