//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр РасходыНаПроекты
	Движения.РасходыНаПроекты.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение                     = Движения.РасходыНаПроекты.Добавить();
		Движение.ДатаРасхода         = Дата;
		Движение.Контрагент          = Контрагент;
		Движение.Проект              = Проект;
		Движение.ВалютаПроекта       = ВалютаВзаиморасчетов;
		Движение.Номенклатура        = ТекСтрокаТовары.Номенклатура;
		Движение.Себестоимость       = ТекСтрокаТовары.Себестоимость;
		Движение.СуммаВзаиморасчетов = ТекСтрокаТовары.СуммаВзаиморасчетов;
		Движение.Возмещаемые         = ТекСтрокаТовары.Возмещаемые;
	КонецЦикла;

КонецПроцедуры

// Обработка события "при записи".
// ................................................................................
Процедура ПриЗаписи(Отказ)

	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Товары.Итог("СуммаВзаиморасчетов");

КонецПроцедуры
