//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВозвращенныеДенежныеСредства 
	Движения.ВозвращенныеДенежныеСредства.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение                      = Движения.ВозвращенныеДенежныеСредства.Добавить();
		Движение.Период               = Дата;
		Движение.Контрагент           = Контрагент;
		Движение.ВалютаВзаиморасчетов = ТекСтрокаПроекты.ВалютаВзаиморасчетов;
		Движение.ВалютаУчета          = Константы.ВалютаУчета.Получить();
		Движение.Проект               = ТекСтрокаПроекты.Проект;
		Движение.ПричинаВозврата      = ТекСтрокаПроекты.ПричинаВозврата;
		Движение.СуммаВзаиморасчетов  = ТекСтрокаПроекты.СуммаВзаиморасчетов;
		Движение.СуммаВВалютеУчета    = ТекСтрокаПроекты.СуммаВзаиморасчетов*УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрокаПроекты.ВалютаВзаиморасчетов);
	КонецЦикла;
	
КонецПроцедуры