&НаКлиенте
Процедура ОповещатьОВыходеНовойВерсииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

Процедура УправлениеВидимостью()
	
	Элементы.ПолучателиОповещений.Доступность = Объект.ОповещатьОВыходеНовойВерсии;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиОповещенийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Получатель) Тогда
		Если ТипЗнч(Элемент.ТекущиеДанные.Получатель) = Тип("Строка") Тогда
			Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Элемент.ТекущиеДанные.Получатель) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введенный адрес электронной почты не соответствует формату!");
				Элемент.ТекущиеДанные.Получатель = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры