Функция ПолучитьДанныеФайла(СсылкаНаФайл, ИдентификаторФормы = Неопределено) Экспорт
		
	ФайлОбъект = СсылкаНаФайл.ПолучитьОбъект();
				
	ДвоичныеДанные = ФайлОбъект.ХранимыйФайл.Получить();
	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
	
	Результат = Новый Структура;
	Результат.Вставить("СсылкаНаДвоичныеДанныеФайла",  СсылкаНаДвоичныеДанныеФайла);	
	Результат.Вставить("ОтносительныйПуть",            ПолучитьИдентификаторОбъекта(ФайлОбъект.ВладелецФайла) + "\");
	Результат.Вставить("ИмяФайла",                     ФайлОбъект.ИмяФайла);
	Результат.Вставить("Наименование",                 ФайлОбъект.Наименование);
	Результат.Вставить("Автор",                        ФайлОбъект.Автор);
	Результат.Вставить("Размер",                       ФайлОбъект.Размер);
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор владельца присоединенного файла.
Функция ПолучитьИдентификаторОбъекта(Знач ВладелецФайлов)
	
	Возврат ""+ВладелецФайлов.УникальныйИдентификатор();
	
КонецФункции

Функция ПолучитьСписокФайлов(ВладелецФайла) Экспорт
	Выборка = Справочники.ЗадачаПрисоединенныеФайлы.Выбрать(,,Новый Структура("ВладелецФайла",ВладелецФайла));
	СписокФайлов = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокФайлов.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	Возврат СписокФайлов;
КонецФункции

Функция ПолучитьКоличествоФайлов(ВладелецФайла) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецФайла",ВладелецФайла);
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаПрисоединенныеФайлы.Ссылка) КАК КоличествоФайлов
	|ИЗ
	|	Справочник.ЗадачаПрисоединенныеФайлы КАК ЗадачаПрисоединенныеФайлы
	|ГДЕ
	|	ЗадачаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	РезультатЗапроса =  Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоФайлов;	
КонецФункции

Функция ДобавитьФайлВБазу(Знач ИмяФайла, Знач АдресФайлаВоВременномХранилище,ВладелецФайла) Экспорт
	
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	ЗаголовокОшибки = НСтр("ru = 'Ошибка при добавлении присоединенного файла.'");
	
	ПрисоединенныйФайл = Справочники.ЗадачаПрисоединенныеФайлы.СоздатьЭлемент();	
	
	ПрисоединенныйФайл.ВладелецФайла                = ВладелецФайла;	
	ПрисоединенныйФайл.Наименование = ИмяФайла;
	ПрисоединенныйФайл.ИмяФайла  = ИмяФайла;
	ПрисоединенныйФайл.Автор = ПараметрыСеанса.ПараметрИсполнитель;
	ПрисоединенныйФайл.Размер                       = ДвоичныеДанные.Размер();
	
	СвояТранзакцияОткрыта = Ложь;
	
	Попытка
		ПрисоединенныйФайл.ХранимыйФайл = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		ПрисоединенныйФайл.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		Если СвояТранзакцияОткрыта Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ШаблонСообщения = НСтр("ru = 'Ошибка при добавлении присоединенного файла ""%1"":
		                             |%2'");
		КомментарийЖурналаРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяФайла,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Файлы.Добавление присоединенного файла'",
			     ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			КомментарийЖурналаРегистрации);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяФайла,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	Возврат ПрисоединенныйФайл.Ссылка;
	
КонецФункции

Функция ВернутьДатуЗадачи(ВладелецФайла) Экспорт
	Возврат ВладелецФайла.Дата;
КонецФункции

Функция ВернутьДатуВыполненияЗадачи(ВладелецФайла) Экспорт
	Возврат ВладелецФайла.ДатаВыполнения;
КонецФункции


