
&НаКлиенте
Процедура ВидКонфигурацииПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры

Процедура УправлениеДоступностью()
	
	Если Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.Типовая")
		ИЛИ Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.ТиповаяИзмененная") Тогда
		ДоступностьТиповойКонфигурации = Истина;
	Иначе
		ДоступностьТиповойКонфигурации = Ложь;
	КонецЕсли;
	Элементы.ТиповаяКонфигурация.Доступность = ДоступностьТиповойКонфигурации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.Типовая") и НЕ ЗначениеЗаполнено(Объект.ТиповаяКонфигурация) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите типовую конфигурацию!",,"ТиповаяКонфигурация","ТиповаяКонфигурация",Отказ);
	КонецЕсли;
КонецПроцедуры
