&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Исполнитель = Справочники.Исполнители.НайтиПоРеквизиту("ФизическоеЛицо", ПараметрыСеанса.ТекущееФизЛицо);
	УстановитьЗначениеПараметра("Исполнитель", Исполнитель);
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметра(Параметр, Значение)
	
	ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Параметр));
	Параметр.Использование = Истина;
	Параметр.Значение = Значение;
	
КонецПроцедуры
