&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;
	Отчет.Исполнитель = Справочники.Исполнители.НайтиПоРеквизиту("ФизическоеЛицо", ПараметрыСеанса.ТекущееФизЛицо);
	
	Если РольДоступна("УП_УдаленныйИсполнитель") Тогда
		Элементы.Исполнитель.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СкомпоноватьРезультат(Результат);
	
КонецПроцедуры