&НаКлиенте
Процедура ИзменениеФлажкаПоказатьЗаверешенные()
	
	ЭлементОтбора = Список.Отбор.Элементы[0];
	Если ПоказыватьЗавершенные Тогда
		ЭлементОтбора.Использование = Ложь;
	Иначе
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.АвторизованныйПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказыватьЗавершенные = Ложь;
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ПолучитьСостояниеПроектов();
	ЭлементОтбора.Использование  = Ложь;
	ИзменениеФлажкаПоказатьЗаверешенные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЗавершенныеПриИзменении(Элемент)
	
	ИзменениеФлажкаПоказатьЗаверешенные();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеПроектов()
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СостоянияПроектов.Согласован);
	СписокЗначений.Добавить(Перечисления.СостоянияПроектов.ПустаяСсылка());
	Возврат СписокЗначений;
	
КонецФункции

#КонецОбласти