#Область ПрограммныйИнтерфейс

// Обработка строки табличной части - вызывается из форм документов.
//
Процедура ОбработатьСтрокуТЧ(Объект, ТекущаяСтрока, СтруктураДействий) Экспорт
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму") Тогда
		СтоимостьПроекта     = 0;
		ВремяВыполненияЧисло = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекущаяСтрока.ВремяВыполнения);
		ТекущаяСтрока.Сумма  = ВремяВыполненияЧисло / 60 * УП_РаботаСДокументамиСервер.ПолучитьСтоимостьЧасаРаботыКонтрагента(Объект.Дата, Объект.Контрагент);
	КонецЕсли;
	Если СтруктураДействий.Свойство("ЗаполнитьВалюту") Тогда
		ТекущаяСтрока.Валюта = УП_РаботаСДокументамиСервер.ПолучитьВалютуУчета();
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуИсполнителя") Тогда
		СтоимостьПроекта     = 0;
		ВремяВыполненияЧисло = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекущаяСтрока.ВремяВыполнения);
		ТекущаяСтрока.Сумма  = ВремяВыполненияЧисло / 60 * УП_РаботаСДокументамиСервер.ПолучитьСтоимостьЧасаРаботыКонтрагента(Объект.Дата, ТекущаяСтрока.Исполнитель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти