//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВзаиморасчетыСИсполнителями Приход
	Движения.ВзаиморасчетыСИсполнителями.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение                      = Движения.ВзаиморасчетыСИсполнителями.Добавить();
		Движение.ВидДвижения          = ВидДвиженияНакопления.Приход;
		Движение.Период               = Дата;
		Движение.Исполнитель          = Исполнитель;
		Движение.ВалютаВзаиморасчетов = ТекСтрокаПроекты.ВалютаВзаиморасчетов;
		Движение.ВалютаУчета          = Константы.ВалютаУчета.Получить();
		Движение.Контрагент           = Контрагент;
		Движение.Проект               = ТекСтрокаПроекты.Проект;
		Движение.СуммаВзаиморасчетов  = ТекСтрокаПроекты.СуммаВзаиморасчетов;
		Движение.СуммаВВалютеУчета    = ТекСтрокаПроекты.СуммаВзаиморасчетов*УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрокаПроекты.ВалютаВзаиморасчетов);
	КонецЦикла;
	
КонецПроцедуры
