Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполнениеПроектов") Тогда
		// Заполнение шапки
		Плательщик                = "";
		Договор                   = ДанныеЗаполнения.Договор;
		Комментарий               = ДанныеЗаполнения.Комментарий;
		Контрагент                = ДанныеЗаполнения.Контрагент;
		Ответственный             = ДанныеЗаполнения.Ответственный;
		ПриПечатиКоличествоРавно1 = ДанныеЗаполнения.ПриПечатиКоличествоРавно1;
		Для Каждого ТекСтрокаПроекты Из ДанныеЗаполнения.Проекты Цикл
			НоваяСтрока                     = Проекты.Добавить();
			НоваяСтрока.ВремяВыполнения     = ТекСтрокаПроекты.ВремяВыполнения;
			НоваяСтрока.Клиент              = ТекСтрокаПроекты.Клиент;
			НоваяСтрока.Проект              = ТекСтрокаПроекты.Проект;
			НоваяСтрока.ПроектПредставление = ТекСтрокаПроекты.ПроектПредставление;
			НоваяСтрока.Сумма               = ТекСтрокаПроекты.Сумма;
			НоваяСтрока.Цена                = ТекСтрокаПроекты.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
