&НаКлиенте
Процедура ИзменитьНаименованиеДоговора()
	
	мНаименование = СтрЗаменить(СокрЛП(Объект.Наименование), "№", Символы.ПС);
	мНаименование = СтрЗаменить(СокрЛП(мНаименование), "от", Символы.ПС);
	мНаименование = СтрПолучитьСтроку(мНаименование, 1);
	
	Если ЗначениеЗаполнено(Объект.Номер) Тогда
		Номер = " №" + Объект.Номер;
	Иначе
		Номер = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ОтДаты = " от " + Формат(Объект.ДатаНачала, "ДЛФ=DD");
	Иначе
		ОтДаты = "";
	КонецЕсли;
	Объект.Наименование = СокрЛП(мНаименование) + Номер + ОтДаты;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	//ЗапросДоговора = Новый Запрос;
	//ЗапросДоговора.Текст =
	//"ВЫБРАТЬ
	//|	ДоговорыКонтрагентов.Ссылка
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|ГДЕ
	//|	ДоговорыКонтрагентов.Владелец = &Владелец
	//|	И &ТекущаяДата МЕЖДУ ДоговорыКонтрагентов.ДатаНачала И ДоговорыКонтрагентов.ДатаОкончания
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//ЗапросДоговора.УстановитьПараметр("Владелец"   , Объект.Владелец);
	//ЗапросДоговора.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//РезультатЗапросаДоговора = ЗапросДоговора.Выполнить();
	//Если НЕ РезультатЗапросаДоговора.Пустой() Тогда
	//	ВыборкаЗапросаДоговора = РезультатЗапросаДоговора.Выбрать();
	//	ВыборкаЗапросаДоговора.Следующий();
	//	Договор = ВыборкаЗапросаДоговора.Ссылка;
	//КонецЕсли;
	//
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ИзменитьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ИзменитьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере();
	
КонецПроцедуры