#Область ОбработчикиДокументов

// Используется в обработке "Документ_ПриОткрытии" любого документа.
//
// Объект. Тип -ДанныеФормыСтурктура. Для установки значений.
// Элементы. Тип -Элементы формы. Для установки значений.
//
// ................................................................................
Процедура Документ_ПриОткрытии(Объект, Элементы) Экспорт
	
	// установим невозможность изменять реквизиты в ТЧ.
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыКоманднаяПанель", Элементы) Тогда
		Элементы.ПроектыКоманднаяПанель.ПодчиненныеЭлементы.ПроектыДобавить.Видимость    = Ложь;
		Элементы.ПроектыКоманднаяПанель.ПодчиненныеЭлементы.ПроектыСкопировать.Видимость = Ложь;
		Элементы.ПроектыКоманднаяПанель.ПодчиненныеЭлементы.ПроектыИзменить.Видимость    = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыКлиент", Элементы) Тогда
		Элементы.ПроектыКлиент.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыПроект", Элементы) Тогда
		Элементы.ПроектыПроект.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыВалюта", Элементы) Тогда
		Элементы.ПроектыВалюта.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыКонтекстноеМенюДобавить", Элементы) Тогда
		Элементы.ПроектыКонтекстноеМенюДобавить.Видимость = Ложь;
	КонецЕсли;
	Если ОбщегоНазначенияКлиент.ЕстьРеквизитФормы("ПроектыКонтекстноеМенюСкопировать", Элементы) Тогда
		Элементы.ПроектыКонтекстноеМенюСкопировать.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти